In [43]:
import pandas as pd
data={"id_producto":[1,2,1,4,5],
     "nombre_producto":["Manzana", "Pera", "Platano", "Naranja", "Uva"],
     "precio":[None, 30.0, 18.75, 25.0, 40.0],
     "cantidad":[10,50,15,20,None],
     }
df=pd.DataFrame(data)
df

   id_producto nombre_producto  precio  cantidad
0            1         Manzana     NaN      10.0
1            2            Pera   30.00      50.0
2            1         Platano   18.75      15.0
3            4         Naranja   25.00      20.0
4            5             Uva   40.00       NaN

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_producto      5 non-null      int64
 1   nombre_producto  5 non-null      object
 2   precio           4 non-null      float64
 3   cantidad         4 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 292.0+ bytes

In [45]:
df.isnull().sum()

id_producto        0
nombre_producto    0
precio             1
cantidad           1
dtype: int64

In [46]:
dflimpio=df.dropna()
dflimpio

   id_producto nombre_producto  precio  cantidad
1            2            Pera   30.00      50.0
2            1         Platano   18.75      15.0
3            4         Naranja   25.00      20.0

In [47]:
dfrelleno=df.fillna({"precio":df["precio"].mean(),"cantidad":0})
dfrelleno

   id_producto nombre_producto   precio  cantidad
0            1         Manzana  28.4375      10.0
1            2            Pera  30.0000      50.0
2            1         Platano  18.7500      15.0
3            4         Naranja  25.0000      20.0
4            5             Uva  40.0000       0.0

In [48]:
df_unicos=df.drop_duplicates(subset=["id_producto"])
df_unicos

   id_producto nombre_producto  precio  cantidad
0            1         Manzana     NaN      10.0
1            2            Pera    30.0      50.0
3            4         Naranja    25.0      20.0
4            5             Uva    40.0       NaN